<?php
//A. error message
$message0 = '　●　例外エラーがあります。';
//login page
$message1 = '　●　アカウントがロックされている状態で、ログインができません。';
$message2 = '　●　ユーザー名またはパスワードが 間違まちがっています。';
$message3 = '　●　パスワードは必須項目です。パスワードを入力してください。';
$message4 = '　●　ユーザー名は必須項目です。ユーザー名を入力してください。';
//signup page
$message5 = '　●　メールアドレスは必須項目です。ユーザー名を入力してください。';
$message6 = '　●　無効なメールアドレスです。';
$message7 = '　●　パスワードとパスワード（確認）は入力内容に誤りがあります。';
$message8 = '　●　ユーザー名は存在しています。';
$message12 = '　●　ユーザー名は数字、文字、アンダースコアのみ、6 文字以上32 文字以内です。';
$message13 = '　●　パスワードは6 文字以上32 文字以内です。';
//auth page
$message11 = 'アカウントが認証できません。アクセスパラメータが不正です。';
//B. success message
$message9 = '　●　アカウントが作成されました。有効化メールを確認してください。';
//C. inform message
$message10 = 'アカウントが認証できました。ログインページにリダイレクトします。';

?> 